In [1]:

import sqlalchemy
import pymysql
from sqlalchemy import create_engine
import pandas as pd

In [2]:
password = '---'
db_name = 'project2'

In [3]:
conn = pymysql.connect(host='127.0.0.1', port=3306, user='root', password=password, database=db_name)

In [4]:
connection = create_engine("mysql+pymysql://root:" + password + "@localhost:3306/" + db_name)

In [5]:
rooms = pd.read_csv('Project 2 Launch  - Rooms.csv')
reservation = pd.read_csv('Project 2 Launch  - Reservations.csv')
guests = pd.read_csv('Project 2 Launch  - Guests.csv')
payments = pd.read_csv('Project 2 Launch  - Payments.csv')

In [6]:
table1 = 'rooms'
table2 = 'reservations'
table3 = 'guests'
table4 = 'payments'

In [7]:
reservation.columns = reservation.columns.str.strip()
rooms.columns = rooms.columns.str.strip()
guests.columns = guests.columns.str.strip()
rooms.columns = rooms.columns.str.strip()

In [8]:
reservation.to_sql(name=table2, con=connection, if_exists='replace', index=False)
rooms.to_sql(name=table1, con=connection, if_exists='replace', index=False)
guests.to_sql(name=table3, con=connection, if_exists='replace', index=False)
payments.to_sql(name=table4, con=connection, if_exists='replace', index=False)

30

In [19]:
query = r""" 

WITH new_reservations AS (
SELECT `Guest ID` AS RES_GUEST_ID, 
`Check-in Date` AS CHECK_IN_DATE, 
`Check-out Date` AS CHECK_OUT_DATE
FROM reservations), 

new_join AS (
SELECT RES_GUEST_ID, Name, 
STR_TO_DATE(CHECK_IN_DATE, '%%m/%%d/%%Y') AS CHECK_IN_DATE2,
STR_TO_DATE(CHECK_OUT_DATE, '%%m/%%d/%%Y') AS CHECK_OUT_DATE2

FROM new_reservations
JOIN guests ON new_reservations.RES_GUEST_ID = guests.Guest_ID)

SELECT 
RES_GUEST_ID, 
Name, 
DATEDIFF(CHECK_OUT_DATE2, CHECK_IN_DATE2) AS STAY_DURATION
FROM new_join

ORDER BY STAY_DURATION DESC
LIMIT 5;
"""

In [20]:
result_df = pd.read_sql(query, con=connection)

In [21]:
result_df

   RES_GUEST_ID               Name  STAY_DURATION
0        834726     Sophia Bennett             13
1        975786         Zoe Watson             11
2        638495          Mia Adams             10
3        628374     Ava Richardson              9
4        276385  Charlotte Jenkins              9